resources/benchmark/synthetic/fanout-w16-http-async/results-done/branch2-yamls-istio-true.log
export PROCESSING_TIME_SERVICE0=0.0010
export PROCESSING_TIME_SERVICE1=0.0010
export PROCESSING_TIME_SERVICE2=0.0010
export PROCESSING_TIME_SERVICE3=0.0010
export PROCESSING_TIME_SERVICE4=0.0010
export PROCESSING_TIME_SERVICE5=0.0010
export PROCESSING_TIME_SERVICE6=0.0010
export PROCESSING_TIME_SERVICE7=0.0010
export PROCESSING_TIME_SERVICE8=0.0010
export PROCESSING_TIME_SERVICE9=0.0010
export PROCESSING_TIME_SERVICE10=0.0010
export PROCESSING_TIME_SERVICE11=0.0010
export PROCESSING_TIME_SERVICE12=0.0010
export PROCESSING_TIME_SERVICE13=0.0010
export PROCESSING_TIME_SERVICE14=0.0010
export PROCESSING_TIME_SERVICE15=0.0010
export PROCESSING_TIME_SERVICE16=0.0010
export WORKER_NODE_SERVICESERVICE5=node1.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE8=node2.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE12=node3.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE9=node4.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE6=node1.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE7=node2.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE3=node3.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE4=node4.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE13=node1.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE11=node2.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE2=node3.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE16=node4.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE15=node1.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE0=node2.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE1=node3.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE14=node4.test.brown-atlas-pg0.utah.cloudlab.us
export WORKER_NODE_SERVICESERVICE10=node1.test.brown-atlas-pg0.utah.cloudlab.us
NAME                         READY   STATUS    RESTARTS   AGE   IP             NODE                                          NOMINATED NODE   READINESS GATES
service0-c6875b968-5w29d     2/2     Running   0          38s   10.244.4.131   node1.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service1-7b49bf6b7d-5l8qp    2/2     Running   0          34s   10.244.1.114   node4.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service10-d6fcc5b88-v275m    2/2     Running   0          37s   10.244.4.132   node1.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service11-55c5668d88-c8mhq   2/2     Running   0          37s   10.244.2.228   node2.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service12-5844c7c964-vqxz2   2/2     Running   0          36s   10.244.3.136   node3.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service13-6896cb6548-4h62v   2/2     Running   0          36s   10.244.1.112   node4.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service14-7f5b8556f6-9b8v2   2/2     Running   0          35s   10.244.1.113   node4.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service15-759d5d7f8d-mg5cs   2/2     Running   0          35s   10.244.4.133   node1.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service16-5cb44f59f6-qrpst   2/2     Running   0          34s   10.244.3.137   node3.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service2-5d7bc6c5b8-kcm6g    2/2     Running   0          33s   10.244.2.229   node2.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service3-76c4d57fdb-5hv4s    2/2     Running   0          33s   10.244.3.138   node3.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service4-5df65dfcb8-zzkl5    2/2     Running   0          32s   10.244.2.230   node2.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service5-696fcc8898-dg7zg    2/2     Running   0          32s   10.244.3.139   node3.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service6-7ff484fb96-bbsgl    2/2     Running   0          31s   10.244.4.134   node1.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service7-5965b7b6c8-9g2hr    2/2     Running   0          31s   10.244.1.115   node4.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service8-54774779d4-7bgvv    2/2     Running   0          30s   10.244.2.231   node2.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
service9-5b88676d8b-mkszt    2/2     Running   0          30s   10.244.4.135   node1.test.brown-atlas-pg0.utah.cloudlab.us   <none>           <none>
Running 30s test @ http://10.108.13.203/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 53.163ms, rate sampling interval: 85ms
  Thread calibration: mean lat.: 53.299ms, rate sampling interval: 84ms
  Thread calibration: mean lat.: 54.142ms, rate sampling interval: 85ms
  Thread calibration: mean lat.: 52.424ms, rate sampling interval: 84ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.39ms    2.33ms  49.54ms   68.75%
    Req/Sec    12.39     20.00    48.00     74.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   39.20ms
 75.000%   40.90ms
 90.000%   42.40ms
 99.000%   44.99ms
 99.900%   49.02ms
 99.990%   49.57ms
 99.999%   49.57ms
100.000%   49.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      31.807     0.000000            1         1.00
      36.511     0.100000          102         1.11
      37.535     0.200000          201         1.25
      38.207     0.300000          299         1.43
      38.751     0.400000          398         1.67
      39.199     0.500000          497         2.00
      39.519     0.550000          548         2.22
      39.871     0.600000          600         2.50
      40.127     0.650000          646         2.86
      40.511     0.700000          697         3.33
      40.895     0.750000          744         4.00
      41.119     0.775000          769         4.44
      41.343     0.800000          795         5.00
      41.567     0.825000          819         5.71
      41.855     0.850000          847         6.67
      42.079     0.875000          872         8.00
      42.239     0.887500          883         8.89
      42.399     0.900000          896        10.00
      42.559     0.912500          906        11.43
      42.687     0.925000          919        13.33
      42.847     0.937500          930        16.00
      43.007     0.943750          937        17.78
      43.231     0.950000          944        20.00
      43.455     0.956250          950        22.86
      43.679     0.962500          955        26.67
      44.031     0.968750          963        32.00
      44.287     0.971875          966        35.56
      44.383     0.975000          968        40.00
      44.479     0.978125          971        45.71
      44.575     0.981250          974        53.33
      44.671     0.984375          977        64.00
      44.735     0.985938          979        71.11
      44.831     0.987500          980        80.00
      44.991     0.989062          982        91.43
      45.087     0.990625          983       106.67
      45.567     0.992188          985       128.00
      45.631     0.992969          986       142.22
      45.631     0.993750          986       160.00
      45.695     0.994531          987       182.86
      46.047     0.995313          988       213.33
      46.975     0.996094          989       256.00
      46.975     0.996484          989       284.44
      46.975     0.996875          989       320.00
      48.927     0.997266          990       365.71
      48.927     0.997656          990       426.67
      49.023     0.998047          991       512.00
      49.023     0.998242          991       568.89
      49.023     0.998437          991       640.00
      49.023     0.998633          991       731.43
      49.023     0.998828          991       853.33
      49.567     0.999023          992      1024.00
      49.567     1.000000          992          inf
#[Mean    =       39.390, StdDeviation   =        2.331]
#[Max     =       49.536, Total count    =          992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.02s, 418.61KB read
Requests/sec:     50.09
Transfer/sec:     13.94KB